tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf65k40_tdd.h
#define SMT2SSEL1                     2207
#define SMT2SIG_SSEL2                 2208
#define SMT2SSEL2                     2209
#define SMT2SIG_SSEL3                 2210
#define SMT2SSEL3                     2211
#define SMT2SIG_SSEL4                 2212
#define SMT2SSEL4                     2213
#define SMT2SIG_SSEL5                 2214
#define SMT2SSEL5                     2215
#define SMT2SIG_SSEL6                 2216
#define SMT2SSEL6                     2217
#define SMT2SIG_SSEL7                 2218
#define SMT2SSEL7                     2219
#define SMT2WIN                       2220
#define SMT2WSEL0                     2221
#define SMT2WIN_WSEL0                 2222
#define SMT2WSEL                      2223
#define SMT2WIN_WSEL                  2224
#define SMT2WSEL1                     2225
#define SMT2WIN_WSEL1                 2226
#define SMT2WSEL2                     2227
#define SMT2WIN_WSEL2                 2228
#define SMT2WSEL3                     2229
#define SMT2WIN_WSEL3                 2230
#define SMT2WSEL4                     2231
#define SMT2WIN_WSEL4                 2232
#define SMT2WSEL5                     2233
#define SMT2WIN_WSEL5                 2234
#define SMT2WSEL6                     2235
#define SMT2WIN_WSEL6                 2236
#define SMT2WSEL7                     2237
#define SMT2WIN_WSEL7                 2238
#define SMT1TMRL                      2239
#define SMT1TMR0                      2240
#define SMT1TMRL_SMT1TMR              2241
#define SMT1TMR1                      2242
#define SMT1TMR2                      2243
#define SMT1TMR3                      2244
#define SMT1TMR4                      2245
#define SMT1TMR5                      2246
#define SMT1TMR6                      2247
#define SMT1TMR7                      2248
#define SMT1TMRH                      2249
#define SMT1TMR8                      2250
#define SMT1TMRH_SMT1TMR              2251
#define SMT1TMR9                      2252
#define SMT1TMR10                     2253
#define SMT1TMR11                     2254
#define SMT1TMR12                     2255
#define SMT1TMR13                     2256
#define SMT1TMR14                     2257
#define SMT1TMR15                     2258
#define SMT1TMRU                      2259
#define SMT1TMR16                     2260
#define SMT1TMRU_SMT1TMR              2261
#define SMT1TMR17                     2262
#define SMT1TMR18                     2263
#define SMT1TMR19                     2264
#define SMT1TMR20                     2265
#define SMT1TMR21                     2266
#define SMT1TMR22                     2267
#define SMT1TMR23                     2268
#define SMT1CPRL                      2269
#define SMT1CPRL_SMT1CPR              2270
#define SMT1CPR0                      2271
#define SMT1CPR1                      2272
#define SMT1CPR2                      2273
#define SMT1CPR3                      2274
#define SMT1CPR4                      2275
#define SMT1CPR5                      2276
#define SMT1CPR6                      2277
#define SMT1CPR7                      2278
#define SMT1CPRH                      2279
#define SMT1CPRH_SMT1CPR              2280
#define SMT1CPR8                      2281
#define SMT1CPR9                      2282
#define SMT1CPR10                     2283
#define SMT1CPR11                     2284
#define SMT1CPR12                     2285
#define SMT1CPR13                     2286
#define SMT1CPR14                     2287
#define SMT1CPR15                     2288
#define SMT1CPRU                      2289
#define SMT1CPR16                     2290
#define SMT1CPRU_SMT1CPR              2291
#define SMT1CPR17                     2292
#define SMT1CPR18                     2293
#define SMT1CPR19                     2294
#define SMT1CPR20                     2295
#define SMT1CPR21                     2296
#define SMT1CPR22                     2297
#define SMT1CPR23                     2298
#define SMT1CPWL                      2299
#define SMT1CPW0                      2300
#define SMT1CPWL_SMT1CPW              2301
#define SMT1CPW1                      2302
#define SMT1CPW2                      2303
#define SMT1CPW3                      2304
#define SMT1CPW4                      2305
#define SMT1CPW5                      2306
#define SMT1CPW6                      2307
#define SMT1CPW7                      2308
#define SMT1CPWH                      2309
#define SMT1CPW8                      2310
#define SMT1CPWH_SMT1CPW              2311
#define SMT1CPW9                      2312
#define SMT1CPW10                     2313
#define SMT1CPW11                     2314
#define SMT1CPW12                     2315
#define SMT1CPW13                     2316
#define SMT1CPW14                     2317
#define SMT1CPW15                     2318
#define SMT1CPWU                      2319
#define SMT1CPWU_SMT1CPW              2320
#define SMT1CPW16                     2321
#define SMT1CPW17                     2322
#define SMT1CPW18                     2323
#define SMT1CPW19                     2324
#define SMT1CPW20                     2325
#define SMT1CPW21                     2326
#define SMT1CPW22                     2327
#define SMT1CPW23                     2328
#define SMT1PRL                       2329
#define SMT1PR0                       2330
#define SMT1PRL_SMT1PR                2331
#define SMT1PR1                       2332
#define SMT1PR2                       2333
#define SMT1PR3                       2334
#define SMT1PR4                       2335
#define SMT1PR5                       2336
#define SMT1PR6                       2337
#define SMT1PR7                       2338
#define SMT1PRH                       2339
#define SMT1PR8                       2340
#define SMT1PRH_SMT1PR                2341
#define SMT1PR9                       2342
#define SMT1PR10                      2343
#define SMT1PR11                      2344
#define SMT1PR12                      2345
#define SMT1PR13                      2346
#define SMT1PR14                      2347
#define SMT1PR15                      2348
#define SMT1PRU                       2349
#define SMT1PR16                      2350
#define SMT1PRU_SMT1PR                2351
#define SMT1PR17                      2352
#define SMT1PR18                      2353
#define SMT1PR19                      2354
#define SMT1PR20                      2355
#define SMT1PR21                      2356
#define SMT1PR22                      2357
#define SMT1PR23                      2358
#define SMT1CON0                      2359
#define SMT1PS0                       2360
#define SMT1PS                        2361
#define SMT1PS1                       2362
#define SMT1CON0_CPOL                 2363
#define SMT1CON0_SPOL                 2364
#define SMT1CON0_WPOL                 2365
#define SMT1CON0_STP                  2366
#define SMT1CON0_EN                   2367
#define SMT1CON1                      2368
#define SMT1CON1_MODE                 2369
#define SMT1MODE0                     2370
#define SMT1CON1_MODE0                2371
#define SMT1MODE                      2372
#define SMT1CON1_MODE1                2373
#define SMT1MODE1                     2374
#define SMT1CON1_MODE2                2375
#define SMT1MODE2                     2376
#define SMT1CON1_MODE3                2377
#define SMT1MODE3                     2378
#define SMT1REPEAT                    2379
#define SMT1CON1_REPEAT               2380
#define SMT1GO                        2381
#define SMT1STAT                      2382
#define SMT1STAT_AS                   2383
#define SMT1AS                        2384
#define SMT1STAT_WS                   2385
#define SMT1WS                        2386
#define SMT1STAT_TS                   2387
#define SMT1TS                        2388
#define SMT1RESET                     2389
#define SMT1STAT_RST                  2390
#define SMT1CPWUP                     2391
#define SMT1STAT_CPWUP                2392
#define SMT1CPRUP                     2393
#define SMT1STAT_CPRUP                2394
#define SMT1CLK                       2395
#define SMT1CSEL                      2396
#define SMT1CLK_CSEL                  2397
#define SMT1CSEL0                     2398
#define SMT1CLK_CSEL0                 2399
#define SMT1CSEL1                     2400
#define SMT1CLK_CSEL1                 2401
#define SMT1CSEL2                     2402
#define SMT1CLK_CSEL2                 2403
#define SMT1CSEL3                     2404
#define SMT1CLK_CSEL3                 2405
#define SMT1CSEL4                     2406
#define SMT1CLK_CSEL4                 2407
#define SMT1CSEL5                     2408
#define SMT1CLK_CSEL5                 2409
#define SMT1CSEL6                     2410
#define SMT1CLK_CSEL6                 2411
#define SMT1CSEL7                     2412
#define SMT1CLK_CSEL7                 2413
#define SMT1SIG                       2414
#define SMT1SSEL                      2415
#define SMT1SIG_SSEL0                 2416
#define SMT1SSEL0                     2417
#define SMT1SIG_SSEL                  2418
#define SMT1SIG_SSEL1                 2419
#define SMT1SSEL1                     2420
#define SMT1SIG_SSEL2                 2421
#define SMT1SSEL2                     2422
#define SMT1SIG_SSEL3                 2423
#define SMT1SSEL3                     2424
#define SMT1SIG_SSEL4                 2425
#define SMT1SSEL4                     2426
#define SMT1SIG_SSEL5                 2427
#define SMT1SSEL5                     2428
#define SMT1SIG_SSEL6                 2429
#define SMT1SSEL6                     2430
#define SMT1SIG_SSEL7                 2431
#define SMT1SSEL7                     2432
#define SMT1WIN                       2433
#define SMT1WSEL                      2434
#define SMT1WIN_WSEL0                 2435
#define SMT1WSEL0                     2436
#define SMT1WIN_WSEL                  2437
#define SMT1WIN_WSEL1                 2438
#define SMT1WSEL1                     2439
#define SMT1WIN_WSEL2                 2440
#define SMT1WSEL2                     2441
#define SMT1WIN_WSEL3                 2442
#define SMT1WSEL3                     2443
#define SMT1WIN_WSEL4                 2444
#define SMT1WSEL4                     2445
#define SMT1WIN_WSEL5                 2446
#define SMT1WSEL5                     2447
#define SMT1WIN_WSEL6                 2448
#define SMT1WSEL6                     2449
#define SMT1WIN_WSEL7                 2450
#define SMT1WSEL7                     2451
#define CCPR5L                        2452
#define CCPR5L_RL                     2453
#define CCPR5H                        2454
#define CCPR5H_RH                     2455
#define CCP5CON                       2456
#define CCP5CON_MODE                  2457
#define CCP5MODE                      2458
#define CCP5MODE0                     2459
#define CCP5CON_MODE0                 2460
#define CCP5MODE1                     2461
#define CCP5CON_MODE1                 2462
#define CCP5MODE2                     2463
#define CCP5CON_MODE2                 2464
#define CCP5MODE3                     2465
#define CCP5CON_MODE3                 2466
#define CCP5FMT                       2467
#define CCP5CON_FMT                   2468
#define CCP5CON_OUT                   2469
#define CCP5OUT                       2470
#define CCP5CON_OE                    2471
#define CCP5OE                        2472
#define CCP5EN                        2473
#define CCP5CON_EN                    2474
#define CCP5CAP                       2475
#define CCP5CAP_CTS0                  2476
#define CCP5CTS                       2477
#define CCP5CTS0                      2478
#define CCP5CAP_CTS                   2479
#define CCP5CAP_CTS1                  2480
#define CCP5CTS1                      2481
#define CCP5CAP_CTS2                  2482
#define CCP5CTS2                      2483
#define CCP5CAP_CTS3                  2484
#define CCP5CTS3                      2485
#define CCP5CAP_CTS4                  2486
#define CCP5CTS4                      2487
#define CCP5CAP_CTS5                  2488
#define CCP5CTS5                      2489
#define CCP5CAP_CTS6                  2490
#define CCP5CTS6                      2491
#define CCP5CAP_CTS7                  2492
#define CCP5CTS7                      2493
#define CCPR4L                        2494
#define CCPR4L_RL                     2495
#define CCPR4H                        2496
#define CCPR4H_RH                     2497
#define CCP4CON                       2498
#define CCP4MODE                      2499
#define CCP4CON_MODE0                 2500
#define CCP4CON_MODE                  2501
#define CCP4MODE0                     2502
#define CCP4CON_MODE1                 2503
#define CCP4MODE1                     2504
#define CCP4CON_MODE2                 2505
#define CCP4MODE2                     2506
#define CCP4CON_MODE3                 2507
#define CCP4MODE3                     2508
#define CCP4FMT                       2509
#define CCP4CON_FMT                   2510
#define CCP4CON_OUT                   2511
#define CCP4OUT                       2512
#define CCP4OE                        2513
#define CCP4CON_OE                    2514
#define CCP4EN                        2515
#define CCP4CON_EN                    2516
#define CCP4CAP                       2517
#define CCP4CTS                       2518
#define CCP4CTS0                      2519
#define CCP4CAP_CTS                   2520
#define CCP4CAP_CTS0                  2521
#define CCP4CTS1                      2522
#define CCP4CAP_CTS1                  2523
#define CCP4CTS2                      2524
#define CCP4CAP_CTS2                  2525
#define CCP4CTS3                      2526
#define CCP4CAP_CTS3                  2527
#define CCP4CTS4                      2528
#define CCP4CAP_CTS4                  2529
#define CCP4CTS5                      2530
#define CCP4CAP_CTS5                  2531
#define CCP4CTS6                      2532
#define CCP4CAP_CTS6                  2533
#define CCP4CTS7                      2534
#define CCP4CAP_CTS7                  2535
#define CCPR3L                        2536
#define CCPR3L_RL                     2537
#define CCPR3H                        2538
#define CCPR3H_RH                     2539
#define CCP3CON                       2540
#define CCP3CON_MODE0                 2541
#define CCP3MODE0                     2542
#define CCP3CON_MODE                  2543
#define CCP3MODE                      2544
#define CCP3CON_MODE1                 2545
#define CCP3MODE1                     2546
#define CCP3CON_MODE2                 2547
#define CCP3MODE2                     2548
#define CCP3CON_MODE3                 2549
#define CCP3MODE3                     2550
#define CCP3CON_FMT                   2551
#define CCP3FMT                       2552
#define CCP3CON_OUT                   2553
#define CCP3OUT                       2554
#define CCP3OE                        2555
#define CCP3CON_OE                    2556
#define CCP3EN                        2557
#define CCP3CON_EN                    2558
#define CCP3CAP                       2559
#define CCP3CAP_CTS                   2560
#define CCP3CTS0                      2561
#define CCP3CAP_CTS0                  2562
#define CCP3CTS                       2563
#define CCP3CTS1                      2564
#define CCP3CAP_CTS1                  2565
#define CCP3CTS2                      2566
#define CCP3CAP_CTS2                  2567
#define CCP3CTS3                      2568
#define CCP3CAP_CTS3                  2569
#define CCP3CTS4                      2570
#define CCP3CAP_CTS4                  2571
#define CCP3CTS5                      2572
#define CCP3CAP_CTS5                  2573
#define CCP3CTS6                      2574
#define CCP3CAP_CTS6                  2575
#define CCP3CTS7                      2576
#define CCP3CAP_CTS7                  2577
#define T8TMR                         2578
#define T8TMR_TMR                     2579
#define TMR8                          2580
#define T8PR_PR                       2581
#define T8PR                          2582
#define T8CON                         2583
#define T8OUTPS0                      2584
#define T8OUTPS                       2585
#define T8CON_OUTPS                   2586
#define T8CON_OUTPS0                  2587
#define T8OUTPS1                      2588
#define T8CON_OUTPS1                  2589
#define T8OUTPS2                      2590
#define T8CON_OUTPS2                  2591
#define T8OUTPS3                      2592
#define T8CON_OUTPS3                  2593
#define T8CKPS                        2594
#define T8CON_CKPS0                   2595
#define T8CON_CKPS                    2596
#define T8CKPS0                       2597
#define T8CON_CKPS1                   2598
#define T8CKPS1                       2599
#define T8CON_CKPS2                   2600
#define T8CKPS2                       2601
#define T8ON                          2602
#define T8CON_ON                      2603
#define TMR8ON                        2604
#define T8HLT                         2605
#define T8HLT_MODE                    2606
#define T8MODE0                       2607
#define T8MODE                        2608
#define T8HLT_MODE0                   2609
#define T8MODE1                       2610
#define T8HLT_MODE1                   2611
#define T8MODE2                       2612
#define T8HLT_MODE2                   2613
#define T8MODE3                       2614
#define T8HLT_MODE3                   2615
#define T8MODE4                       2616
#define T8HLT_MODE4                   2617
#define T8CKSYNC                      2618
#define T8HLT_CKSYNC                  2619
#define T8HLT_CKPOL                   2620
#define T8CKPOL                       2621
#define T8HLT_PSYNC                   2622
#define T8PSYNC                       2623
#define T8CLKCON                      2624
#define T8CLKCON_CS                   2625
#define T8CS0                         2626
#define T8CS                          2627
#define T8CLKCON_CS0                  2628
#define T8CS1                         2629
#define T8CLKCON_CS1                  2630
#define T8CS2                         2631
#define T8CLKCON_CS2                  2632
#define T8CS3                         2633
#define T8CLKCON_CS3                  2634
#define T8RST                         2635
#define T8RST_RSEL0                   2636
#define T8RST_RSEL                    2637
#define T8RSEL                        2638
#define T8RSEL0                       2639
#define T8RST_RSEL1                   2640
#define T8RSEL1                       2641
#define T8RSEL2                       2642
#define T8RST_RSEL2                   2643
#define T8RSEL3                       2644
#define T8RST_RSEL3                   2645
#define TMR7L0                        2646
#define TMR7L                         2647
#define CAL07                         2648
#define TMR7L1                        2649
#define CAL17                         2650
#define TMR7L2                        2651
#define CAL27                         2652
#define TMR7L3                        2653
#define CAL37                         2654
#define TMR7L4                        2655
#define CAL47                         2656
#define TMR7L5                        2657
#define CAL57                         2658
#define TMR7L6                        2659
#define CAL67                         2660
#define TMR7L7                        2661
#define CAL77                         2662
#define TMR7H0                        2663
#define TMR7H                         2664
#define TMR7H1                        2665
#define TMR7H2                        2666
#define TMR7H3                        2667
#define TMR7H4                        2668
#define TMR7H5                        2669
#define TMR7H6                        2670
#define TMR7H7                        2671
#define T7CON                         2672
#define TMR7ON                        2673
#define T7CON_ON                      2674
#define T7RD16                        2675
#define T7CON_RD16                    2676
#define RD167                         2677
#define T7CON_nSYNC                   2678
#define T7CON_NOT_SYNC                2679
#define NOT_T7SYNC                    2680
#define nT7SYNC                       2681
#define T7CON_CKPS0                   2682
#define T7CON_CKPS                    2683
#define T7CKPS0                       2684
#define T7CON_CKPS1                   2685
#define T7CKPS1                       2686
#define T7GCON                        2687
#define T7GVAL                        2688
#define T7GCON_GVAL                   2689
#define T7GCON_GGO_NOT_DONE           2690
#define T7GGO_nDONE                   2691
#define T7GGO                         2692
#define T7GCON_GGO_nDONE              2693
#define T7GGO_NOT_DONE                2694
#define T7GCON_GSPM                   2695
#define T7GSPM                        2696
#define T7GTM                         2697
#define T7GCON_GTM                    2698
#define T7GCON_GPOL                   2699
#define T7GPOL                        2700
#define T7GCON_GE                     2701
#define T7GE                          2702
#define T7GATE                        2703
#define T7GSS0                        2704
#define T7GATE_GSS0                   2705
#define T7GATE_GSS                    2706
#define T7GSS1                        2707
#define T7GATE_GSS1                   2708
#define T7GSS2                        2709
#define T7GATE_GSS2                   2710
#define T7GSS3                        2711
#define T7GATE_GSS3                   2712
#define T7GSS4                        2713
#define GSS4                          2714
#define T7CLK                         2715
#define T7CS0                         2716
#define T7CLK_CS                      2717
#define T7CLK_CS0                     2718
#define T7CS1                         2719
#define T7CLK_CS1                     2720
#define T7CS2                         2721
#define T7CLK_CS2                     2722
#define T7CS3                         2723
#define T7CLK_CS3                     2724
#define CLKRCON                       2725
#define CLKRDIV0                      2726
#define DIV                           2727
#define DIV0                          2728
#define CLKRDIV1                      2729
#define DIV1                          2730
#define DIV2                          2731
#define CLKRDIV2                      2732
#define CLKRCON_DC                    2733
#define CLKRCON_DC0                   2734
#define CLKRDC0                       2735
#define CLKRCON_DC1                   2736
#define CLKRDC1                       2737
#define CLKRCON_EN                    2738
#define CLKREN                        2739
#define CLKRCLK                       2740
#define CLKRCLK0                      2741
#define CLK                           2742
#define CLK0                          2743
#define CLKRCLK1                      2744
#define CLK1                          2745
#define CLKRCLK2                      2746
#define CLK2                          2747
#define CWG1CLKCON                    2748
#define CWG1CLKCON_CS                 2749
#define CWG1CS                        2750
#define CWG1ISM                       2751
#define CWG1ISM0                      2752
#define IS                            2753
#define CWG1ISM1                      2754
#define CWG1ISM2                      2755
#define CWG1ISM3                      2756
#define CWG1DBR0                      2757
#define CWG1DBR                       2758
#define DBR                           2759
#define DBR0                          2760
#define CWG1DBR1                      2761
#define DBR1                          2762
#define CWG1DBR2                      2763
#define DBR2                          2764
