tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf65k40_tdd.h
#define CWG1DBR3                      2765
#define DBR3                          2766
#define CWG1DBR4                      2767
#define DBR4                          2768
#define CWG1DBR5                      2769
#define DBR5                          2770
#define CWG1DBF                       2771
#define CWG1DBF0                      2772
#define DBF                           2773
#define DBF0                          2774
#define CWG1DBF1                      2775
#define DBF1                          2776
#define CWG1DBF2                      2777
#define DBF2                          2778
#define CWG1DBF3                      2779
#define DBF3                          2780
#define CWG1DBF4                      2781
#define DBF4                          2782
#define DBF5                          2783
#define CWG1DBF5                      2784
#define CWG1CON0                      2785
#define CWG1MODE0                     2786
#define CWG1CON0_MODE                 2787
#define CWG1CON0_MODE0                2788
#define CWG1MODE                      2789
#define CWG1MODE1                     2790
#define CWG1CON0_MODE1                2791
#define CWG1MODE2                     2792
#define CWG1CON0_MODE2                2793
#define LD                            2794
#define CWG1LD                        2795
#define CWG1EN                        2796
#define G1EN                          2797
#define CWG1CON0_EN                   2798
#define CWG1CON1                      2799
#define CWG1POLA                      2800
#define POLA                          2801
#define CWG1POLB                      2802
#define POLB                          2803
#define CWG1POLC                      2804
#define POLC                          2805
#define CWG1POLD                      2806
#define POLD                          2807
#define IN                            2808
#define CWG1IN                        2809
#define CWG1AS0                       2810
#define CWG1LSAC                      2811
#define LSAC                          2812
#define LSAC0                         2813
#define CWG1LSAC0                     2814
#define LSAC1                         2815
#define CWG1LSAC1                     2816
#define LSBD0                         2817
#define CWG1LSBD0                     2818
#define LSBD                          2819
#define CWG1LSBD                      2820
#define LSBD1                         2821
#define CWG1LSBD1                     2822
#define CWG1REN                       2823
#define REN                           2824
#define CWG1SHUTDOWN                  2825
#define SHUTDOWN                      2826
#define CWG1AS1                       2827
#define AS0E                          2828
#define AS1E                          2829
#define AS2E                          2830
#define AS3E                          2831
#define AS4E                          2832
#define AS5E                          2833
#define AS6E                          2834
#define AS7E                          2835
#define CWG1STR                       2836
#define CWG1STRA                      2837
#define STRA                          2838
#define STRB                          2839
#define CWG1STRB                      2840
#define CWG1STRC                      2841
#define STRC                          2842
#define CWG1STRD                      2843
#define STRD                          2844
#define OVRA                          2845
#define CWG1OVRA                      2846
#define CWG1OVRB                      2847
#define OVRB                          2848
#define OVRC                          2849
#define CWG1OVRC                      2850
#define OVRD                          2851
#define CWG1OVRD                      2852
#define CRCDATL                       2853
#define DATA0                         2854
#define DATA1                         2855
#define DATA2                         2856
#define DATA3                         2857
#define DATA4                         2858
#define DATA5                         2859
#define DATA6                         2860
#define DATA7                         2861
#define CRCDATH                       2862
#define DATA8                         2863
#define DATA9                         2864
#define DATA10                        2865
#define DATA11                        2866
#define DATA12                        2867
#define DATA13                        2868
#define DATA14                        2869
#define DATA15                        2870
#define CRCACCL                       2871
#define ACC0                          2872
#define ACC1                          2873
#define ACC2                          2874
#define ACC3                          2875
#define ACC4                          2876
#define ACC5                          2877
#define ACC6                          2878
#define ACC7                          2879
#define CRCACCH                       2880
#define ACC8                          2881
#define ACC9                          2882
#define ACC10                         2883
#define ACC11                         2884
#define ACC12                         2885
#define ACC13                         2886
#define ACC14                         2887
#define ACC15                         2888
#define CRCSHIFTL                     2889
#define SHFT0                         2890
#define SHFT1                         2891
#define SHFT2                         2892
#define SHFT3                         2893
#define SHFT4                         2894
#define SHFT5                         2895
#define SHFT6                         2896
#define SHFT7                         2897
#define CRCSHIFTH                     2898
#define SHFT8                         2899
#define SHFT9                         2900
#define SHFT10                        2901
#define SHFT11                        2902
#define SHFT12                        2903
#define SHFT13                        2904
#define SHFT14                        2905
#define SHFT15                        2906
#define CRCXORL                       2907
#define X1                            2908
#define X2                            2909
#define X3                            2910
#define X4                            2911
#define X5                            2912
#define X6                            2913
#define X7                            2914
#define CRCXORH                       2915
#define X8                            2916
#define X9                            2917
#define X10                           2918
#define X11                           2919
#define X12                           2920
#define X13                           2921
#define X14                           2922
#define X15                           2923
#define CRCCON0                       2924
#define FULL                          2925
#define SHIFTM                        2926
#define ACCM                          2927
#define CRCCON0_BUSY                  2928
#define CRCGO                         2929
#define CRCCON0_EN                    2930
#define CRCEN                         2931
#define CRCCON1                       2932
#define PLEN0                         2933
#define PLEN                          2934
#define PLEN1                         2935
#define PLEN2                         2936
#define PLEN3                         2937
#define DLEN                          2938
#define DLEN0                         2939
#define DLEN1                         2940
#define DLEN2                         2941
#define DLEN3                         2942
#define SCANLADRL                     2943
#define SCANLADRL_LADR                2944
#define SCANLADRL_SCANLADR            2945
#define LADR0                         2946
#define SCANLADR0                     2947
#define SCANLADR1                     2948
#define LADR1                         2949
#define LADR2                         2950
#define SCANLADR2                     2951
#define LADR3                         2952
#define SCANLADR3                     2953
#define LADR4                         2954
#define SCANLADR4                     2955
#define LADR5                         2956
#define SCANLADR5                     2957
#define SCANLADR6                     2958
#define LADR6                         2959
#define LADR7                         2960
#define SCANLADR7                     2961
#define SCANLADRH                     2962
#define LADR8                         2963
#define SCANLADRH_SCANLADR            2964
#define SCANLADR8                     2965
#define SCANLADRH_LADR                2966
#define LADR9                         2967
#define SCANLADR9                     2968
#define LADR10                        2969
#define SCANLADR10                    2970
#define SCANLADR11                    2971
#define LADR11                        2972
#define LADR12                        2973
#define SCANLADR12                    2974
#define LADR13                        2975
#define SCANLADR13                    2976
#define LADR14                        2977
#define SCANLADR14                    2978
#define LADR15                        2979
#define SCANLADR15                    2980
#define SCANLADRU                     2981
#define LADR16                        2982
#define SCANLADR16                    2983
#define SCANLADRU_SCANLADR            2984
#define SCANLADRU_LADR                2985
#define SCANLADR17                    2986
#define LADR17                        2987
#define LADR18                        2988
#define SCANLADR18                    2989
#define LADR19                        2990
#define SCANLADR19                    2991
#define SCANLADR20                    2992
#define LADR20                        2993
#define SCANLADR21                    2994
#define LADR21                        2995
#define SCANHADRL                     2996
#define SCANHADR0                     2997
#define HADR0                         2998
#define SCANHADRL_HADR                2999
#define SCANHADRL_SCANHADR            3000
#define SCANHADR1                     3001
#define HADR1                         3002
#define SCANHADR2                     3003
#define HADR2                         3004
#define SCANHADR3                     3005
#define HADR3                         3006
#define SCANHADR4                     3007
#define HADR4                         3008
#define SCANHADR5                     3009
#define HADR5                         3010
#define SCANHADR6                     3011
#define HADR6                         3012
#define SCANHADR7                     3013
#define HADR7                         3014
#define SCANHADRH                     3015
#define HADR8                         3016
#define SCANHADRH_SCANHADR            3017
#define SCANHADR8                     3018
#define SCANHADRH_HADR                3019
#define HADR9                         3020
#define SCANHADR9                     3021
#define HADR10                        3022
#define SCANHADR10                    3023
#define SCANHADR11                    3024
#define HADR11                        3025
#define HADR12                        3026
#define SCANHADR12                    3027
#define HADR13                        3028
#define SCANHADR13                    3029
#define HADR14                        3030
#define SCANHADR14                    3031
#define HADR15                        3032
#define SCANHADR15                    3033
#define SCANHADRU                     3034
#define SCANHADRU_SCANHADR            3035
#define SCANHADRU_HADR                3036
#define HADR16                        3037
#define SCANHADR16                    3038
#define SCANHADR17                    3039
#define HADR17                        3040
#define HADR18                        3041
#define SCANHADR18                    3042
#define HADR19                        3043
#define SCANHADR19                    3044
#define HADR20                        3045
#define SCANHADR20                    3046
#define SCANHADR21                    3047
#define HADR21                        3048
#define SCANCON0                      3049
#define SCANMODE0                     3050
#define SCANCON0_MODE                 3051
#define SCANCON0_MODE0                3052
#define SCANMODE                      3053
#define SCANMODE1                     3054
#define SCANCON0_MODE1                3055
#define INTM                          3056
#define SCANINTM                      3057
#define DABORT                        3058
#define SCANINVALID                   3059
#define INVALID                       3060
#define SCANCON0_BUSY                 3061
#define SCANBUSY                      3062
#define SCANCON0_GO                   3063
#define SCANGO                        3064
#define SCANCON0_EN                   3065
#define SCANEN                        3066
#define SCANTRIG                      3067
#define TSEL0                         3068
#define TSEL                          3069
#define SCANTSEL0                     3070
#define SCANTSEL                      3071
#define TSEL1                         3072
#define SCANTSEL1                     3073
#define TSEL2                         3074
#define SCANTSEL2                     3075
#define TSEL3                         3076
#define SCANTSEL3                     3077
#define MDCON0                        3078
#define MDBIT                         3079
#define BIT                           3080
#define OPOL                          3081
#define MDOPOL                        3082
#define MDOUT                         3083
#define MDCON0_OUT                    3084
#define MDEN                          3085
#define MDCON0_EN                     3086
#define MDCON1                        3087
#define MDCLSYNC                      3088
#define CLSYNC                        3089
#define MDCLPOL                       3090
#define CLPOL                         3091
#define CHSYNC                        3092
#define MDCHSYNC                      3093
#define MDCHPOL                       3094
#define CHPOL                         3095
#define MDSRC                         3096
#define SRCS0                         3097
#define MDSRCS                        3098
#define SRCS                          3099
#define MDSRCS0                       3100
#define SRCS1                         3101
#define MDSRCS1                       3102
#define SRCS2                         3103
#define MDSRCS2                       3104
#define SRCS3                         3105
#define MDSRCS3                       3106
#define MDCARL                        3107
#define CLS0                          3108
#define MDCLS                         3109
#define MDCLS0                        3110
#define CLS                           3111
#define CLS1                          3112
#define MDCLS1                        3113
#define CLS2                          3114
#define MDCLS2                        3115
#define MDCARH                        3116
#define CHS0                          3117
#define CHS                           3118
#define MDCHS                         3119
#define MDCHS0                        3120
#define CHS1                          3121
#define MDCHS1                        3122
#define CHS2                          3123
#define MDCHS2                        3124
#define ADACT0                        3125
#define ADACT                         3126
#define ADACT1                        3127
#define ADACT2                        3128
#define ADACT3                        3129
#define ADACT4                        3130
#define ADCLK                         3131
#define ADCS0                         3132
#define ADCLK_ADCS                    3133
#define ADCS1                         3134
#define ADCS2                         3135
#define ADCS3                         3136
#define ADCS4                         3137
#define ADCS5                         3138
#define ADREF                         3139
#define ADPREF                        3140
#define ADPREF0                       3141
#define ADPREF1                       3142
#define ADNREF                        3143
#define ADCON1                        3144
#define ADDSEN                        3145
#define NVCFG0                        3146
#define NVCFG1                        3147
#define PVCFG0                        3148
#define CHSN3                         3149
#define PVCFG1                        3150
#define VCFG11                        3151
#define ADGPOL                        3152
#define ADIPEN                        3153
#define ADPPOL                        3154
#define ADCON2                        3155
#define ADMD                          3156
#define ADMD0                         3157
#define ADMD1                         3158
#define ADMD2                         3159
#define ADACLR                        3160
#define ADCRS                         3161
#define ADCRS0                        3162
#define ADCRS1                        3163
#define ADCRS2                        3164
#define ADPSIS                        3165
#define ADCON3                        3166
#define ADTMD                         3167
#define ADTMD0                        3168
#define ADTMD1                        3169
#define ADTMD2                        3170
#define ADSOI                         3171
#define ADCALC                        3172
#define ADCALC0                       3173
#define ADCALC1                       3174
#define ADCALC2                       3175
#define ADACQ                         3176
#define ADACQ0                        3177
#define ADACQ1                        3178
#define ADACQ2                        3179
#define ADACQ3                        3180
#define ADACQ4                        3181
#define ADACQ5                        3182
#define ADACQ6                        3183
#define ADACQ7                        3184
#define ADCAP                         3185
#define ADCAP0                        3186
#define ADCAP1                        3187
#define ADCAP2                        3188
#define ADCAP3                        3189
#define ADCAP4                        3190
#define ADPRE0                        3191
#define ADPRE                         3192
#define ADPRE1                        3193
#define ADPRE2                        3194
#define ADPRE3                        3195
#define ADPRE4                        3196
#define ADPRE5                        3197
#define ADPRE6                        3198
#define ADPRE7                        3199
#define ADPCH                         3200
#define ADPCH0                        3201
#define ADPCH1                        3202
#define ADPCH2                        3203
#define ADPCH3                        3204
#define ADPCH4                        3205
#define ADPCH5                        3206
#define ADCON0                        3207
#define ADCON0_GO                     3208
#define DONE                          3209
#define GO_NOT_DONE                   3210
#define GO_nDONE                      3211
#define ADGO                          3212
#define GODONE                        3213
#define ADFM                          3214
#define ADFM0                         3215
#define ADCON0_ADCS                   3216
#define ADCONT                        3217
#define ADCAL                         3218
#define ADON                          3219
#define ADPREVL                       3220
#define ADPREV0                       3221
#define ADPREV1                       3222
#define ADPREV2                       3223
#define ADPREV3                       3224
#define ADPREV4                       3225
#define ADPREV5                       3226
#define ADPREV6                       3227
#define ADPREV7                       3228
#define ADPREVH                       3229
#define ADPREV8                       3230
#define ADPREV9                       3231
#define ADPREV10                      3232
#define ADPREV11                      3233
#define ADPREV12                      3234
#define ADPREV13                      3235
#define ADPREV14                      3236
#define ADPREV15                      3237
#define ADRESL                        3238
#define ADRES0                        3239
#define ADRES1                        3240
#define ADRES2                        3241
#define ADRES3                        3242
#define ADRES4                        3243
#define ADRES5                        3244
#define ADRES6                        3245
#define ADRES7                        3246
#define ADRESH                        3247
#define ADRES8                        3248
#define ADRES9                        3249
#define ADRES10                       3250
#define ADRES11                       3251
#define ADRES12                       3252
#define ADRES13                       3253
#define ADRES14                       3254
#define ADRES15                       3255
#define ADSTAT                        3256
#define ADSTAT0                       3257
#define ADSTAT1                       3258
#define ADSTAT2                       3259
#define ADMATH                        3260
#define ADLTHR                        3261
#define ADUTHR                        3262
#define ADAOV                         3263
#define ADRPT0                        3264
#define ADRPT                         3265
#define ADRPT1                        3266
#define ADRPT2                        3267
#define ADRPT3                        3268
#define ADRPT4                        3269
#define ADRPT5                        3270
#define ADRPT6                        3271
#define ADRPT7                        3272
#define ADCNT0                        3273
#define ADCNT                         3274
#define ADCNT1                        3275
#define ADCNT2                        3276
#define ADCNT3                        3277
#define ADCNT4                        3278
#define ADCNT5                        3279
#define ADCNT6                        3280
#define ADCNT7                        3281
#define ADSTPT0                       3282
#define ADSTPTL                       3283
#define ADSTPT1                       3284
#define ADSTPT2                       3285
#define ADSTPT3                       3286
#define ADSTPT4                       3287
#define ADSTPT5                       3288
#define ADSTPT6                       3289
#define ADSTPT7                       3290
#define ADSTPT8                       3291
#define ADSTPTH                       3292
#define ADSTPT9                       3293
#define ADSTPT10                      3294
#define ADSTPT11                      3295
#define ADSTPT12                      3296
#define ADSTPT13                      3297
#define ADSTPT14                      3298
#define ADSTPT15                      3299
#define ADLTH0                        3300
#define ADLTHL                        3301
#define ADLTH1                        3302
#define ADLTH2                        3303
#define ADLTH3                        3304
#define ADLTH4                        3305
#define ADLTH5                        3306
#define ADLTH6                        3307
#define ADLTH7                        3308
#define ADLTH8                        3309
#define ADLTHH                        3310
#define ADLTH9                        3311
#define ADLTH10                       3312
#define ADLTH11                       3313
#define ADLTH12                       3314
#define ADLTH13                       3315
#define ADLTH14                       3316
#define ADLTH15                       3317
#define ADUTH0                        3318
#define ADUTHL                        3319
#define ADUTH1                        3320
#define ADUTH2                        3321
#define ADUTH3                        3322
